MyHome/src/Documents/мх_РегистрацияДоходов/мх_РегистрацияДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_РегистрацияДоходов</name>
  <registerRecords>AccumulationRegister.мх_ПланированиеБюджета</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.мх_Доходы</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.мх_КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.мх_СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнеплановыйДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.мх_КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.мх_СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <type>
        <types>Characteristic.мх_СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнеплановыйДоход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/мх_РегистрацияДоходов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикиСобытийДокументов.ЗаполнитьРеквизитыДокументаПоШаблону(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ОбработчикиСобытийДокументов.ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти(	ЭтотОбъект,
																				"Доходы",
																				"Кошелек, СтатьяДоходов, АналитикаДоходов, ДатаОперации, ВнеплановыйДоход",
																				"Сумма");
	
	ЗаполнитьРеквизитыСумм();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.мх_РегистрацияДоходов.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияДенежныхСредств(ЭтотОбъект, Отказ);
	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияДоходыРасходы(ЭтотОбъект, Отказ);
	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияДоходы(ЭтотОбъект, Отказ);
	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияПланированиеБюджета(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыСумм()

	ЭтотОбъект.Сумма = Доходы.Итог("Сумма");

КонецПроцедуры

#КонецОбласти

#КонецЕсли
